app/Http/Controllers/Site/SiteController.php

    public function getServiceCategory()
    {
        try {
            $data = SchServiceCategory::select(
                'id',
                'name'
            )->get();
---
select `id`, `name` from `sch_service_categories`

    public function getBranch()
    {
        try {
            $data = CmnBranch::select(
                'id',
                'name'
            )->get();
---
select `id`, `name` from `cmn_branches`

    public function getServiceTimeSlot(Request $request)
    {
        try {

            $bookingRepo = new BookingRepository();
            $day = (new Carbon($request->date))->format('w');
            $date = $request->date;

            //check employee holiday
            $employeeOffDay = SchEmployeeOffday::where('sch_employee_id', $request->sch_employee_id)
                ->where('start_date', '<=',  $date)->where('end_date', '>=',  $date)->exists();
            if ($employeeOffDay) {
                return $this->apiResponse(['status' => '5', 'data' => "Selected date is Staff Holiday/Leave"], 400);
            }

            //check employee holiday
            $employeeSchedule = $schedule = SchEmployeeSchedule::where('sch_employee_id', $request->sch_employee_id)
                ->where('day', $day)->where('is_off_day', 1)->exists();
            if ($employeeSchedule) {
                return $this->apiResponse(['status' => '5', 'data' => translate("Today is weekly holiday")], 400);
            }

            //check business holiday
            $businessHoliday = CmnBusinessHoliday::where('cmn_branch_id', $request->cmn_branch_id)
                ->where('start_date', '<=', $date)->where('end_date', '>=', $date)->exists();
---
select exists(select * from `sch_employee_offdays` where `sch_employee_id` = '2' and `start_date` <= '2023-11-13' and `end_date` >= '2023-11-13') as `exists`
select exists(select * from `sch_employee_schedules` where `sch_employee_id` = '2' and `day` = '1' and `is_off_day` = 1) as `exists`
select exists(select * from `cmn_business_holidays` where `cmn_branch_id` = '1' and `start_date` <= '2023-11-13' and `end_date` >= '2023-11-13') as `exists`

            }

            //check weekly holiday
            $businessHours = CmnBusinessHour::where('is_off_day', 1)->where('cmn_branch_id', $request->cmn_branch_id)->where('day', $day)->exists();
---
select exists(select * from `cmn_business_hours` where `is_off_day` = 1 and `cmn_branch_id` = '1' and `day` = '1') as `exists`

            }

            //get employee schedule
            $schedule = SchEmployeeSchedule::where('sch_employee_id', $request->sch_employee_id)
                ->where('day', $day)->select(
                    'start_time',
                    'end_time',
                    'break_start_time',
                    'break_end_time',
                )->first();
---
select `start_time`, `end_time`, `break_start_time`, `break_end_time` from `sch_employee_schedules` where `sch_employee_id` = '2' and `day` = '1' limit 1

    public function saveBooking(Request $request)
    {
        DB::beginTransaction();
         try {
            $request = (object)$request->bookingData;
            $bookingRepo = new BookingRepository();
            $customerId = 0;
            $customer = "";

            //if login by user
            if (auth()->check()) {
                $customer = CmnCustomer::where('user_id', auth()->id())->select('id', 'phone_no')->first();
                // if ($request->payment_type == PaymentType::UserBalance) {
                //     $userBalance = auth()->user()->balance();
                //     if ($userBalance == null)
                //         throw new ErrorException(translate('You do not have enough balance in your account'));
                // }
            } else {

                // if ($request->payment_type == PaymentType::UserBalance)
                //     throw new ErrorException(translate("You can't make payment by user balance without login try another one"));
                $customer = CmnCustomer::where('phone_no', $request->phone_no)->orWhere('email', $request->email)->select('id', 'phone_no')->first();
---
select `id`, `phone_no` from `cmn_customers` where `phone_no` = '+56543253245' or `email` = 'asdfas@gfdh.cl' limit 1

                    // 'city' => $request->city,
                    // 'street_address' => $request->street_address
                ];
                $cstRtrn = CmnCustomer::create($saveCustomer);
---
insert into `cmn_customers` (`full_name`, `phone_no`, `email`, `updated_at`, `created_at`) values ('vfadads', '+56543253245', 'asdfas@gfdh.cl', '2023-11-08 21:05:09', '2023-11-08 21:05:09')

            foreach ($request->items as $key => $item) {
                $item = (object)$item;
                //get employee wise service charge
                $serviceCharge = SchEmployeeService::where('sch_employee_id', $item->sch_employee_id)
                    ->where('sch_service_id', $item->sch_service_id)->select('fees')->first();
---
select `fees` from `sch_employee_services` where `sch_employee_id` = '2' and `sch_service_id` = '2' limit 1

            //     $couponDiscount = 0;
            // }

            $serviceBookingInfo = SchServiceBookingInfo::create([
                'booking_date' => Carbon::now(),
                'cmn_customer_id' => $customerId,
                'total_amount' => 0.0,
                'payable_amount' => 0,
                'paid_amount' => 0,
                'due_amount' => 0,
                'is_due_paid' => 0,
                'coupon_code' => '',
                'coupon_discount' => $couponDiscount,
                'remarks' => '',
                'created_by' => auth()->id()
            ]);
---
insert into `sch_service_booking_infos` (`booking_date`, `cmn_customer_id`, `total_amount`, `payable_amount`, `paid_amount`, `due_amount`, `is_due_paid`, `coupon_code`, `coupon_discount`, `remarks`, `created_by`, `updated_at`, `created_at`) values ('2023-11-09 15:50:04', 117, 0, 0, 0, 0, 0, '', 0, '', '', '2023-11-09 15:50:04', '2023-11-09 15:50:04')