app/Http/Repository/Booking/BookingRepository.php

select `appoinntment_limit_type`, `appoinntment_limit`, `minimum_time_required_to_booking_in_days`, `minimum_time_required_to_booking_in_time`, `minimum_time_required_to_cancel_in_days`, `minimum_time_required_to_cancel_in_time` from `sch_services` where `id` = '2' limit 1
---
    public function IsServiceLimitation($serviceDate, $customerId, $serviceId, $checkServiceLimit, $checkBookingLimit)
    {
        $service = SchServices::where('id', $serviceId)
            ->select(
                'appoinntment_limit_type',
                'appoinntment_limit',
                'minimum_time_required_to_booking_in_days',
                'minimum_time_required_to_booking_in_time',
                'minimum_time_required_to_cancel_in_days',
                'minimum_time_required_to_cancel_in_time'
            )->first();

select `value` from `cmn_currency_setups` limit 1
select `sch_employees`.`id`, `sch_employees`.`full_name`, `sch_employee_services`.`fees` from `sch_employee_services` inner join `sch_employees` on `sch_employee_services`.`sch_employee_id` = `sch_employees`.`id` where `sch_employee_services`.`sch_service_id` = '2' and `sch_employees`.`cmn_branch_id` = '1' and `sch_employee_services`.`status` = 1 and `sch_employees`.`status` in (1)
---
    public function getEmployeeByService($serviceId, $branchId, $employeeStatus)
    {
        $currency = CmnCurrencySetup::select('value')->first();
        $data = SchEmployeeService::join('sch_employees', 'sch_employee_services.sch_employee_id', '=', 'sch_employees.id')
            ->where('sch_employee_services.sch_service_id', $serviceId)
            ->where('sch_employees.cmn_branch_id', $branchId)
            ->where('sch_employee_services.status', 1)
            ->whereIn('sch_employees.status', $employeeStatus)
            ->select(
                'sch_employees.id',
                'sch_employees.full_name',
                'sch_employee_services.fees'
            )->get();